cfg/Documents/ПлатежноеПоручениеВходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручениеВходящее</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявлениеРасчетВФСС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоНачислениямЗаСчетФСС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>(Общ) Банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийППВходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявлениеРасчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявлениеРасчетВФСС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/AccumulationRegisters/ВзаиморасчетыПоНачислениямЗаСчетФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоНачислениямЗаСчетФСС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийРасчетыСФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасчетовСФСС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cfg/AccumulationRegisters/ВзаиморасчетыСРаботникамиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСРаботникамиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСуммаНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовСРаботниками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cfg/Enums/КодыОперацийРасчетыСФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>КодыОперацийРасчетыСФСС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начислено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>КодыОперацийВзаиморасчетыСРаботникамиОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносОстатковНаСледующийМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносОстатковСПредыдущегоМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьНалоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыплатаАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыплатаМежрасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыплатаДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыплатаДепонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПогашениеНачисленийПоФактуВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Займы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Documents/ПлатежноеПоручениеВходящее/Ext/ObjectModule.bsl
/// Формирует номер платежного поручения в пределах расчетного счета
//
Процедура УстановитьНомерПоручения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("ДатаКонцаГода", КонецГода(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетОрганизации", СчетОрганизации);
	

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НомерВходящегоДокумента КАК НомерВходящегоДокумента
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручение
	|
	|ГДЕ
	|	ПлатежноеПоручение.Организация = &Организация
	|	И ПлатежноеПоручение.СчетОрганизации = &СчетОрганизации
	|	И ПлатежноеПоручение.Дата >= &ДатаНачалаГода
	|	И ПлатежноеПоручение.Дата <= &ДатаКонцаГода";

	СписокПлатежек = Запрос.Выполнить().Выбрать();
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	 
	ТаблицаЗначений.Колонки.Добавить("Номер"); 
	ТаблицаЗначений.Колонки.Добавить("Длина"); 

	Пока СписокПлатежек.Следующий() Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить(); 
		НоваяСтрока.Номер = СписокПлатежек.НомерВходящегоДокумента; 
		НоваяСтрока.Длина = СтрДлина(СписокПлатежек.НомерВходящегоДокумента); 
	КонецЦикла;
	
	ТаблицаЗначений.Сортировать("Длина Убыв, Номер Убыв");
	
	Попытка
		НомерНомерВходящегоДокументаЧисло = Число(ТаблицаЗначений[0].Номер) + 1;
		НомерНомерВходящегоДокумента = Формат(НомерНомерВходящегоДокументаЧисло, "ЧГ=0");
	Исключение
		НомерВходящегоДокумента = 1;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьЗапросДляРасчетаСумм()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ЕстьNULL(ПлатежноеПоручениеВходящееЗаявки.ЗаявлениеРасчет.ВсегоПоДокументу,0) КАК Сумма 
	                |ИЗ
	                |	Документ.ПлатежноеПоручениеВходящее.Заявки КАК ПлатежноеПоручениеВходящееЗаявки
	                |ГДЕ
	                |	ПлатежноеПоручениеВходящееЗаявки.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить();				
					
Конецфункции

Процедура РассчитатьСумму() Экспорт
	Сумма = 0;
	
	РезультатЗапросаПоДокументам = ПолучитьЗапросДляРасчетаСумм();
	ВыборкаПоДокументам = РезультатЗапросаПоДокументам.Выбрать();
		
		Пока ВыборкаПоДокументам.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПоДокументам.Сумма) Тогда
	    		Сумма = Сумма + ВыборкаПоДокументам.Сумма;
			КонецЕсли;	
		КонецЦикла;
		
		СуммаДокумента = Сумма;
	
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = "
	|Выбрать РАЗРЕШЕННЫЕ
	|	Дата,
	|	Организация,
	|	Ответственный,
	|	Контрагент,
	|	СчетОрганизации,
	|	СчетКонтрагента,
	| 	Ссылка
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросДляПроведения()
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр( "ССылка" , Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПлатежноеПоручениеВходящееЗаявки.ЗаявлениеРасчет.Ссылка,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Организация,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.ПериодВзаиморасчетов,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СтатьяРасчетовСФСС,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сотрудник,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.СчетУчета,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Сумма,
	               |	ВзаиморасчетыПоНачислениямЗаСчетФСС.Документ
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее.Заявки КАК ПлатежноеПоручениеВходящееЗаявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоНачислениямЗаСчетФСС КАК ВзаиморасчетыПоНачислениямЗаСчетФСС
	               |		ПО ПлатежноеПоручениеВходящееЗаявки.ЗаявлениеРасчет.Ссылка = ВзаиморасчетыПоНачислениямЗаСчетФСС.Регистратор
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящееЗаявки.Ссылка = &Ссылка";
		   
	Возврат Запрос.Выполнить();		
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана организация!';uk='Не зазначена організація!'"), Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Ответственный) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указано ответственное лицо!';uk='Не вказана відповідальна особа!'"), Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Контрагент) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указан контрагент!';uk='Не зазначений контрагент!'"), Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	РезультатЗапросаПоДокументам = СформироватьЗапросДляПроведения();
	ВыборкаПоДокументам = РезультатЗапросаПоДокументам.Выбрать();
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		//движения по РН ВзаиморасчетыПоНачислениямЗаСчетФСС
		Движение = Движения.ВзаиморасчетыПоНачислениямЗаСчетФСС.Добавить();
	
		// Свойства
		Движение.Период                 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
	
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		Движение.ПериодВзаиморасчетов	= ВыборкаПоДокументам.ПериодВзаиморасчетов;
		Движение.СтатьяРасчетовСФСС     = ВыборкаПоДокументам.СтатьяРасчетовСФСС;
		Движение.Сотрудник              = ВыборкаПоДокументам.Сотрудник;
		Движение.СчетУчета			    = ВыборкаПоДокументам.СчетУчета;
		
		// Ресурсы
		Движение.Сумма					= ВыборкаПоДокументам.Сумма; 
	
		//Реквизиты
		Движение.Документ 				= ВыборкаПоДокументам.Документ;
		Движение.КодОперации			= Перечисления.КодыОперацийРасчетыСФСС.Получено;

		//движения по РН ВзаиморасчетыСРаботникамиОрганизаций
        Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		
		// Свойства
		Движение.Период					= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения   			= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		Движение.ПериодВзаиморасчетов	= ВыборкаПоДокументам.ПериодВзаиморасчетов;
		Движение.Сотрудник				= ВыборкаПоДокументам.Сотрудник;
		Движение.СчетУчета			    = ВыборкаПоДокументам.СчетУчета;
		
		// Ресурсы
		Движение.СуммаВзаиморасчетов	= ВыборкаПоДокументам.Сумма;
		
		//Реквизиты
		Движение.КодОперации			= Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Начисления;
	КонецЦикла
	
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		
		// Движения по документу
		Если Не Отказ Тогда
			ДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента,Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если	ТипЗнч(Основание)	=	Тип("ДокументСсылка.ЗаявлениеРасчетВФСС")	Тогда
		
		Организация = Основание.Организация;
		Если ЗначениеЗаполнено(Организация) Тогда
			СчетОрганизации = Организация.БанковскийСчетДляРасчетовСФСС;
		Иначе
			СчетОрганизации = Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		НоваяСтрока = Заявки.Добавить();
		НоваяСтрока.ЗаявлениеРасчет = Основание;
        СуммаДокумента = Основание.ВсегоПоДокументу;

	КонецЕсли;
	
	
КонецПроцедуры
